# Структура квиза
quiz_data = [
    {
        'question': 'Что такое "Баг"?',
        'options': ['Насекомое в коде', 'Синоним "Фича"', 'То, что мешает спать по ночам', 'Всё вышеперечисленное'],
        'correct_option': 3
    },
    {
        'question': 'Что такое "рекурсия"?',
        'options': ['Когда функция вызывает саму себя', 'Когда программист вызывает себя на дуэль', 'Когда код зацикливается, как кот за хвостом', 'Когда?'],
        'correct_option': 0
    },
    {
        'question': 'Что такое "компилятор"?',
        'options': ['Типо кода комбинатор, эвеэма оператор >:/ йо', 'То, что ругается на твой код', 'Переводчик с языка программирования на машинный код'],
        'correct_option': 2
    },
    {
        'question': 'Кто такой "Pythin"?',
        'options': ['Другой вопрос, пожалуйста:)', 'Президент программирования', 'Я знаю'],
        'correct_option': 0
    },
    {
        'question': 'Что делает программист, когда его код работает, но медленно?',
        'options': ['Оптимизирует', 'Покупает новый компьютер', 'эээ... и так норм', 'Идёт пить кофе'],
        'correct_option': 0
    },
    {
        'question': 'Что делает программист, когда его код не компилируется?',
        'options': ['Винит компилятор', 'Винит компьютер', 'Дебаг', 'Винит блок питания', 'Бедаг :( ', 'Идёт пить кофе'],
        'correct_option': 2
    },
    {
        'question': 'Что делает программист, когда его код работает, но он не знает почему?',
        'options': ['Ничего, главное — работает', 'Прячет код от коллег', 'Идёт пить кофе'],
        'correct_option': 0
    },
    {
        'question': 'Что делает программист, когда у него заканчивается кофе?',
        'options': ['Лан подём покурим', 'Завтра продолжу', 'Начинает писать код на Python', 'Идёт за новым кофе'],
        'correct_option': 3
    },    
    {
        'question': 'Что такое "нейронная сеть"?',
        'options': ['Нейроны программистов соединенные в сеть', 'Aлгоритм, который учится на ошибках других', 'Когда компьютер думает, что он человек', 'Компьютерная модель которая... там много крч'],
        'correct_option': 3
    },
    {
        'question': 'Что такое "бигдата"?',
        'options': ['Начальник говорит: "Нужно больше данных!"', 'Данных так много, что даже Excel плачет'],
        'correct_option': 1
    },
    {
        'question': 'Что такое "облачные вычисления"?',
        'options': ['Когда программист витает в облаках', 'Твой код работает где-то далеко', 'ААААААААА! НЕБО УПАЛО!'],
        'correct_option': 1
    },
    {
        'question': 'Что такое "машинное обучение"?',
        'options': ['Когда ругаешься на комп градиентами', 'Когда код становится умнее тебя', 'Область искусственного интеллекта'],
        'correct_option': 2
    },
    {
        'question': 'Что такое "DevOps"?',
        'options': ['Дружба разработчиков и операционщиков', 'Автоматизируй всё, что движется!', 'Надежда, что код сам себя запустит', 'Незнаю, но звучит круто'],
        'correct_option': 0
    },
    {
        'question': '212323456 + 1234567342 = ... ?',
        'options': ['1446880798', 'int', 'Я вам че?! Этот Алеберт Эшент?!'],
        'correct_option': 1
    },
    {
        'question': 'Юг находится снизу или сверху?',
        'options': ['Вы че на ШАРЕ живете???', 'Да, юг находится внизу на современных картах', 'Ну тут как посмотеть...'],
        'correct_option': 1
    },
    {
        'question': 'Зачем вы зашли так далеко?',
        'options': ['Здесь нет вопроса (но имеется ряд докопок!)', 'Прокастинация', 'Всвязиспроизводственнойнеобходимостью'],
        'correct_option': 0
    },
]
